app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @photo = Photo.find(params[:id])

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = 1
---
  def index
    @photos = Photo.where(:user_id => params[:user_id])