app/controllers/users_controller.rb

  def create
    @user = User.create(params[:user])
---
INSERT INTO "users" ("created_at", "password_digest", "session_token", "updated_at", "username") VALUES (?, ?, ?, ?, ?)